In [2]:
%matplotlib inline
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [3]:
taula = pd.read_csv('Customers.csv')

In [4]:
taula.head()

,CustomerID,Gender,Age,Annual Income ($),Spending Score (1-100),Profession,Work Experience,Family Size
0,1,Male,19,15000,39,Healthcare,1,4
1,2,Male,21,35000,81,Engineer,3,3
2,3,Female,20,86000,6,Engineer,1,1
3,4,Female,23,59000,77,Lawyer,0,2
4,5,Female,31,38000,40,Entertainment,2,6

In [8]:
taula.columns = ['ID', 'Genere', 'Edat', 'IngresosAnuals', 'Puntuacio', 'Professio', 'ExperienciaLaboral', 'NumFamiliar']

In [9]:
taula.head()

,ID,Genere,Edat,IngresosAnuals,Puntuacio,Professio,ExperienciaLaboral,NumFamiliar
0,1,Male,19,15000,39,Healthcare,1,4
1,2,Male,21,35000,81,Engineer,3,3
2,3,Female,20,86000,6,Engineer,1,1
3,4,Female,23,59000,77,Lawyer,0,2
4,5,Female,31,38000,40,Entertainment,2,6

In [ ]:
#1. Mostrar quins són els clients amb el seu numero de familiars que tenen un ranking més alt dels ingresos de la nostra tenda 
# en base a la professió que tenen.

In [75]:
dades_agrupades = taula.groupby('Professio').apply(lambda x: x.sort_values('IngresosAnuals', ascending=False))

In [76]:
clients_top = dades_agrupades.groupby('ID').head()

In [77]:
clients_top[['ID', 'NumFamiliar', 'IngresosAnuals', 'Professio']]

                    ID  NumFamiliar  IngresosAnuals  Professio
Professio
Artist    1825  1826.0          6.0        189709.0     Artist
          1165  1166.0          1.0        189498.0     Artist
          658    659.0          6.0        189446.0     Artist
          921    922.0          6.0        189091.0     Artist
          652    653.0          3.0        189072.0     Artist
...                ...          ...             ...        ...
Marketing 138    139.0          4.0         22000.0  Marketing
          54      55.0          1.0         18000.0  Marketing
          212    213.0          4.0         12000.0  Marketing
          155    156.0          4.0         10000.0  Marketing
          288    289.0          1.0          5000.0  Marketing

[1965 rows x 4 columns]

In [69]:
# 2. Mostrar una gràfica de barres la mitJana dels ingressos de l’empresa segons la professio.

In [84]:
dades_agrupades

                    ID  Genere  Edat  IngresosAnuals  Puntuacio  Professio  \
Professio
Artist    1825  1826.0    Male   7.0        189709.0       18.0     Artist
          1165  1166.0    Male  19.0        189498.0       18.0     Artist
          658    659.0  Female  31.0        189446.0       38.0     Artist
          921    922.0    Male  52.0        189091.0       12.0     Artist
          652    653.0  Female  16.0        189072.0       86.0     Artist
...                ...     ...   ...             ...        ...        ...
Marketing 138    139.0    Male  19.0         22000.0       10.0  Marketing
          54      55.0  Female  50.0         18000.0       45.0  Marketing
          212    213.0    Male  86.0         12000.0       70.0  Marketing
          155    156.0  Female  27.0         10000.0       89.0  Marketing
          288    289.0  Female  21.0          5000.0       91.0  Marketing

                ExperienciaLaboral  NumFamiliar  Professor
Professio
Artist    1825                 6.0          6.0        NaN
          1165                 4.0          1.0        NaN
          658                  1.0          6.0        NaN
          921                  0.0          6.0        NaN
          652                  6.0          3.0        NaN
...                            ...          ...        ...
Marketing 138                  8.0          4.0        NaN
          54                   1.0          1.0        NaN
          212                  2.0          4.0        NaN
          155                  8.0          4.0        NaN
          288                  0.0          1.0        NaN

[1965 rows x 9 columns]

In [122]:
promigIngresosPerProfesio = clients_top[['IngresosAnuals']].groupby('Professio').mean()

In [123]:
promigIngresosPerProfesio

               IngresosAnuals
Professio
Artist          108776.580065
Doctor          111573.217391
Engineer        111161.240223
Entertainment   110650.333333
Executive       113770.130719
Healthcare      112574.041298
Homemaker       108758.616667
Lawyer          110995.838028
Marketing       107994.211765

In [121]:
promigIngresosPerProfesio.plot(kind='barh', y='ID', x='IngresosAnuals')
plt.show()

KeyError: 'ID'